org/scala/into-the-readerT-verse.org
#+TITLE: Into ReaderT-verse
#+DATE: <2019-03-25 Mon>
#+AUTHOR: Jichao Ouyang
#+MACRO: ruby @@html:<ruby>$1<rt>$2</rt></ruby>@@
#+description: As what I've been discussed in [[https://blog.oyanglul.us/scala/3-layer-cake][3 Layer Scala Cake]] ReaderT pattern is pretty much enough
#+description: for most case. So, let's dive into the ReaderT universe and see how can we factor those effects out.
#+KEYWORDS: Scala,Monad,MTL,ReaderT
#+HTML_HEAD_EXTRA: <meta property="og:title" content="Into ReaderT-verse" />
#+HTML_HEAD_EXTRA: <meta property="og:description" content="ReaderT monad is all you need!!!" />
#+HTML_HEAD_EXTRA: <meta property="og:type" content="article" />
#+INDEX: Scala!3 Into ReaderT-verse
#+INDEX: FP!3 Into ReaderT-verse
#+INDEX: ReaderT!3 Into ReaderT-verse
#+INDEX: Monad!3 Into ReaderT-verse

To keep this article reletively small, lets scope our problem smaller
* The Program
I'll start with a simple deja vu program.

#+BEGIN_SRC scala
  val sourceBucketName = "source-bucket"
  val fileName = "fileA"
  val targetBucketName = "target-bucket"
  val awsClient = AmazonS3ClientBuilder.standard().build()
  def pureBusinessProcess(content: String): String = ???
  def program = {
    val content = awsClient.getObject(sourceBucketName, fileName)
    val result = pureBusinessProcess(content)
    awsClient.putObject(targetBucketName, fileName)
  }
#+END_SRC

It's pretty simple program:
1. fetch a file from s3 bucket A
2. process the content according to what business you have
3. put the result into a file in bucket B


* The Problem
Such program looks pretty clean and readable but implementation like this is never good enough for production because it lack of:
1. Error handling
2. Testability
3. Logging

If we add those 3 factors, the =program= will not clean and readable anymore

#+BEGIN_SRC scala
    val awsClient = AmazonS3ClientBuilder.standard().build()
    def pureBusinessProcess(content: String): String = ???
    val logger = org.log4s.getLogger
    def program(client: AmazonS3) = {
      val content = try {
        val content = try {
          awsClient.getObject(sourceBucketName, fileName)
        } catch {
          case e: Throwable =>
            logger.error("error fetching file from S3")
            throw e
        }
        val result = pureBusinessProcess(content)
        try {
          awsClient.putObject(targetBucketName, fileName)
        } catch {
          case e: Throwable =>
            logger.error("error puting file to S3")
            throw e
        }
      } catch { 
        case e: Throwable => logger.error(s"error processing $fileName from $sourceBucketName: ${e.getMessage}")
      }
    }
#+END_SRC

So, we factor the effect =client: AmazonS3= as parameter to achieve little improvement of testability, however,
this is an absolutly crap, the core process of the program is totally lost in the ocean of error handling and logging.

