scala/into-the-readerT-verse.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-09-17 Sat 08:03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Into ReaderT-verse</title>
<meta name="author" content="Jichao Ouyang" />
<meta name="description" content="As what I've been discussed in [[https://blog.oyanglul.us/scala/3-layer-cake][3 Layer Scala Cake]] ReaderT pattern is pretty much enough
for most case. So, let's dive into the ReaderT universe and see how can we factor those effects out." />
<meta name="keywords" content="Scala,Monad,MTL,ReaderT" />
<meta name="generator" content="Org Mode" />
<link rel="icon" href="/favicon.ico">
<meta name="theme-color" content="#ffffff">
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/style/toc.css"/>
<link rel="stylesheet" href="/style/tufte.css"/>
<link rel="stylesheet" href="/style/main.css"/>
<link rel="alternate" type="application/rss+xml" title="Jichao Ouyang" href="https://feeds.oyanglul.us/JichaoOuyangsBlog"/>
<meta property="og:title" content="Into ReaderT-verse" />
<meta property="og:description" content="ReaderT monad is all you need!!!" />
<meta property="og:type" content="article" />
</head>
<body>
<div id="preamble" class="status">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-NJRFJGX"
                  height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<header>
    <a accesskey="h" href="/index.html"> HOME </a> |
    <a href="#" id="edit-in-github">EDIT</a> |
    <a href="https://feeds.oyanglul.us/JichaoOuyangsBlog">RSS</a> |
    <a href="https://blog.oyanglul.us/theindex">INDEX</a> |
    <a accesskey="H" href="/jichao.ouyang.html">ABOUT</a> |
    <a href="https://github.com/jcouyang/blog">GITHUB</a>
</header>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Into ReaderT-verse</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc3ea460">The Program</a></li>
<li><a href="#org2d831fa">The Problem</a></li>
<li><a href="#orge1ef84d">A better version with ReaderT</a>
<ul>
<li><a href="#org6159c21">Layer 2</a></li>
<li><a href="#orge62a4aa">Layer 3</a></li>
</ul>
</li>
<li><a href="#orgf12be94">ReaderT-verse</a></li>
</ul>
</div>
</nav>
<p>
To keep this article reletively small, lets scope our problem smaller
</p>
<div id="outline-container-orgc3ea460" class="outline-2">
<h2 id="orgc3ea460">The Program</h2>
<div class="outline-text-2" id="text-orgc3ea460">
<p>
I'll start with a simple deja vu program.
</p>

<pre class="code"><code><span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">sourceBucketName</span> <span style="color: #81A1C1;">=</span> <span style="color: #D08770;">"source-bucket"</span>
<span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">fileName</span> <span style="color: #81A1C1;">=</span> <span style="color: #D08770;">"fileA"</span>
<span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">targetBucketName</span> <span style="color: #81A1C1;">=</span> <span style="color: #D08770;">"target-bucket"</span>
<span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">awsClient</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">AmazonS3ClientBuilder</span>.standard().build()
<span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">pureBusinessProcess</span>(content<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span> <span style="color: #81A1C1;">=</span> ???
<span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">program</span> <span style="color: #81A1C1;">=</span> {
  <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">content</span> <span style="color: #81A1C1;">=</span> awsClient.getObject(sourceBucketName, fileName)
  <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">result</span> <span style="color: #81A1C1;">=</span> pureBusinessProcess(content)
  awsClient.putObject(targetBucketName, fileName)
}
</code></pre>

<p>
It's pretty simple program:
</p>
<ol class="org-ol">
<li>fetch a file from s3 bucket A</li>
<li>process the content according to what business you have</li>
<li>put the result into a file in bucket B</li>
</ol>
</div>
</div>


<div id="outline-container-org2d831fa" class="outline-2">
<h2 id="org2d831fa">The Problem</h2>
<div class="outline-text-2" id="text-org2d831fa">
<p>
Such program looks pretty clean and readable but implementation like this is never good enough for production because it lack of:
</p>
<ol class="org-ol">
<li>Error handling</li>
<li>Testability</li>
<li>Logging</li>
</ol>

<p>
If we add those 3 factors, the <code>program</code> will not clean and readable anymore
</p>

<pre class="code"><code><span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">awsClient</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">AmazonS3ClientBuilder</span>.standard().build()
<span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">pureBusinessProcess</span>(content<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span> <span style="color: #81A1C1;">=</span> ???
<span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">logger</span> <span style="color: #81A1C1;">=</span> org.log4s.getLogger
<span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">program</span>(client<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">AmazonS3</span>) <span style="color: #81A1C1;">=</span> {
  <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">content</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">try</span> {
    <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">content</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">try</span> {
      awsClient.getObject(sourceBucketName, fileName)
    } <span style="color: #81A1C1;">catch</span> {
      <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">e</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Throwable</span> <span style="color: #81A1C1;">=&gt;</span>
        logger.error(<span style="color: #D08770;">"error fetching file from S3"</span>)
        <span style="color: #81A1C1;">throw</span> e
    }
    <span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">result</span> <span style="color: #81A1C1;">=</span> pureBusinessProcess(content)
    <span style="color: #81A1C1;">try</span> {
      awsClient.putObject(targetBucketName, fileName)
    } <span style="color: #81A1C1;">catch</span> {
      <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">e</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Throwable</span> <span style="color: #81A1C1;">=&gt;</span>
        logger.error(<span style="color: #D08770;">"error puting file to S3"</span>)
        <span style="color: #81A1C1;">throw</span> e
    }
  } <span style="color: #81A1C1;">catch</span> { 
    <span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">e</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Throwable</span> <span style="color: #81A1C1;">=&gt;</span> logger.error(s<span style="color: #D08770;">"error processing </span><span style="font-weight: bold;">$fileName</span><span style="color: #D08770;"> from </span><span style="font-weight: bold;">$sourceBucketName</span><span style="color: #D08770;">: </span><span style="font-weight: bold;">${e.getMessage}</span><span style="color: #D08770;">"</span>)
  }
}
</code></pre>

<p>
So, we factor the effect <code>client: AmazonS3</code> as parameter to achieve little improvement of testability, however,
this is an absolutly crap, the core process of the program is totally lost in the ocean of error handling and logging.
</p>
</div>
</div>
