org/scala/into-the-readerT-verse.org
* A better version with ReaderT
With ReaderT, we will get a better version of:

1. DI[fn:1]
2. Error Handling[fn:2]

Instead of parameterize =client=, we change the return type of
=program= to =ReaderT[IO, AmazonS3, Unit]=
#+BEGIN_SRC scala
  def program: ReaderT[IO, AmazonS3, Unit] = for {
    content <- Kleisli(client => IO(client.getObject(sourceBucketName, fileName)))
      .onError{case e:Throwable => IO(logger.error("error fetching file from S3: ${e.getMessage}"))}
    result = pureBusinessProcess(content)
    _ <- Kleisli(client => IO(client.putObject(targetBucketName, fileName)))
      .onError{case e: Throwable => IO(logger.error("error puting file to S3"))}
  } yield ()
#+END_SRC

Ok it's little bit better though I don't think it's very readable.

Now it's the best feature of functional programming, ReaderT is pure so you can put that "not so readable thing" anywhere
and give it a reasonable name.

#+BEGIN_SRC scala
  val fetchContent = Kleisli(client => IO(client.getObject(sourceBucketName, fileName)))
      .onError{case e:Throwable => IO(logger.error("error fetching file from S3: ${e.getMessage}"))}
  
  def putContent(content: String) = Kleisli(client => IO(client.putObject(targetBucketName, fileName, content)))
      .onError{case e: Throwable => IO(logger.error("error puting file to S3: ${e.getMessage}"))}

  def program: ReaderT[IO, AmazonS3, PutObjectResult] = for {
    content <- fetchContent
    result = pureBusinessProcess(content)
    _ <- putContent(result)
  } yield ()
#+END_SRC

Fine, that's better at readability, but testing journey won't be much difference, I still need to mock the =client=
and stub =getObject= and =putObject=.
#+BEGIN_SRC scala
val fakeClient = mock[AmazonS3]
val res = mock[PutObjectResult]
fakeClient.getObject(sourceBucketName, fileName) returns "some content"
fakeClient.putObject(targetBucketName, fileName, "processed") returns res
program.run(fakeClient).unsafeRunSync must_== res
#+END_SRC

Not bad but not good either, we can avoid mocking and stubing by abstract another layer, just like [[file:3-layer-cake.org][3 Layer Scala Cake]]

** Layer 2
#+BEGIN_SRC scala
trait Interpreter[F[_]] {
    def getObject(bucketName: String, fileName: String): F[String]
    def putObject(bucketName: String, fileName: String, content: String): F[PutObjectResult]
}
#+END_SRC

** Layer 3
#+BEGIN_SRC scala
  def program: ReaderT[IO, Interpreter[IO], PutObjectResult] = for {
    content <- Kleisli(_.getObject(sourceBucketName, fileName))
    result = pureBusinessProcess(content)
    _ <- Kleisli(_.putObject(targetBucketName, fileName, result))
  } yield ()
#+END_SRC

A =Kleisli= before =_.getObject...= barely sacrifice our readability but the benifit we get is that we can
swap Layer 2 with abitrary interpreter in test
#+BEGIN_SRC scala
    val res = mock[PutObjectResult]
    program.run(new Interpreter[IO] {
      def getObject(bucketName: String, fileName: String) = IO("some content")
      def putObject(bucketName: String, fileName: String, content: String) = res
    }).unsafeRunSync() must_== res

#+END_SRC

