scala/into-the-readerT-verse.html

<div id="outline-container-orge1ef84d" class="outline-2">
<h2 id="orge1ef84d">A better version with ReaderT</h2>
<div class="outline-text-2" id="text-orge1ef84d">
<p>
With ReaderT, we will get a better version of:
</p>

<ol class="org-ol">
<li>DI<label for="1" class="margin-toggle sidenote-number"></label><input type="checkbox" id="1" class="margin-toggle"/><span class="sidenote">
Dependency Injection
</span></li>
<li>Error Handling<label for="2" class="margin-toggle sidenote-number"></label><input type="checkbox" id="2" class="margin-toggle"/><span class="sidenote">
thanks to <a href="https://typelevel.org/cats/api/cats/MonadError.html">MonadError</a>
</span></li>
</ol>

<p>
Instead of parameterize <code>client</code>, we change the return type of
<code>program</code> to <code>ReaderT[IO, AmazonS3, Unit]</code>
</p>
<pre class="code"><code><span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">program</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">ReaderT</span>[<span style="color: #81A1C1;">IO</span>, <span style="color: #81A1C1;">AmazonS3</span>, <span style="color: #81A1C1;">Unit</span>] <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">for</span> {
  content <span style="color: #81A1C1;">&lt;-</span> <span style="color: #81A1C1;">Kleisli</span>(client <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">IO</span>(client.getObject(sourceBucketName, fileName)))
    .onError{<span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">e</span><span style="color: #81A1C1;">:</span><span style="color: #81A1C1;">Throwable</span> <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">IO</span>(logger.error(<span style="color: #D08770;">"error fetching file from S3: ${e.getMessage}"</span>))}
  result <span style="color: #81A1C1;">=</span> pureBusinessProcess(content)
  <span style="color: #81A1C1;">_</span> <span style="color: #81A1C1;">&lt;-</span> <span style="color: #81A1C1;">Kleisli</span>(client <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">IO</span>(client.putObject(targetBucketName, fileName)))
    .onError{<span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">e</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Throwable</span> <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">IO</span>(logger.error(<span style="color: #D08770;">"error puting file to S3"</span>))}
} <span style="color: #81A1C1;">yield</span> ()
</code></pre>

<p>
Ok it's little bit better though I don't think it's very readable.
</p>

<p>
Now it's the best feature of functional programming, ReaderT is pure so you can put that "not so readable thing" anywhere
and give it a reasonable name.
</p>

<pre class="code"><code><span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">fetchContent</span> <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Kleisli</span>(client <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">IO</span>(client.getObject(sourceBucketName, fileName)))
    .onError{<span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">e</span><span style="color: #81A1C1;">:</span><span style="color: #81A1C1;">Throwable</span> <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">IO</span>(logger.error(<span style="color: #D08770;">"error fetching file from S3: ${e.getMessage}"</span>))}

<span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">putContent</span>(content<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>) <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">Kleisli</span>(client <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">IO</span>(client.putObject(targetBucketName, fileName, content)))
    .onError{<span style="color: #81A1C1;">case</span> <span style="font-weight: bold;">e</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">Throwable</span> <span style="color: #81A1C1;">=&gt;</span> <span style="color: #81A1C1;">IO</span>(logger.error(<span style="color: #D08770;">"error puting file to S3: ${e.getMessage}"</span>))}

<span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">program</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">ReaderT</span>[<span style="color: #81A1C1;">IO</span>, <span style="color: #81A1C1;">AmazonS3</span>, <span style="color: #81A1C1;">PutObjectResult</span>] <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">for</span> {
  content <span style="color: #81A1C1;">&lt;-</span> fetchContent
  result <span style="color: #81A1C1;">=</span> pureBusinessProcess(content)
  <span style="color: #81A1C1;">_</span> <span style="color: #81A1C1;">&lt;-</span> putContent(result)
} <span style="color: #81A1C1;">yield</span> ()
</code></pre>

<p>
Fine, that's better at readability, but testing journey won't be much difference, I still need to mock the <code>client</code>
and stub <code>getObject</code> and <code>putObject</code>.
</p>
<pre class="code"><code><span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">fakeClient</span> <span style="color: #81A1C1;">=</span> mock[<span style="color: #81A1C1;">AmazonS3</span>]
<span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">res</span> <span style="color: #81A1C1;">=</span> mock[<span style="color: #81A1C1;">PutObjectResult</span>]
fakeClient.getObject(sourceBucketName, fileName) returns <span style="color: #D08770;">"some content"</span>
fakeClient.putObject(targetBucketName, fileName, <span style="color: #D08770;">"processed"</span>) returns res
program.run(fakeClient).unsafeRunSync must_== res
</code></pre>

<p>
Not bad but not good either, we can avoid mocking and stubing by abstract another layer, just like <a href="3-layer-cake.html">3 Layer Scala Cake</a>
</p>
</div>

<div id="outline-container-org6159c21" class="outline-3">
<h3 id="org6159c21">Layer 2</h3>
<div class="outline-text-3" id="text-org6159c21">
<pre class="code"><code><span style="color: #81A1C1;">trait</span> <span style="color: #81A1C1;">Interpreter</span>[<span style="color: #81A1C1;">F</span>[<span style="color: #81A1C1;">_</span>]] {
    <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">getObject</span>(bucketName<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>, fileName<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">F</span>[<span style="color: #81A1C1;">String</span>]
    <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">putObject</span>(bucketName<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>, fileName<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>, content<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>)<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">F</span>[<span style="color: #81A1C1;">PutObjectResult</span>]
}
</code></pre>
</div>
</div>

<div id="outline-container-orge62a4aa" class="outline-3">
<h3 id="orge62a4aa">Layer 3</h3>
<div class="outline-text-3" id="text-orge62a4aa">
<pre class="code"><code><span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">program</span><span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">ReaderT</span>[<span style="color: #81A1C1;">IO</span>, <span style="color: #81A1C1;">Interpreter</span>[<span style="color: #81A1C1;">IO</span>], <span style="color: #81A1C1;">PutObjectResult</span>] <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">for</span> {
  content <span style="color: #81A1C1;">&lt;-</span> <span style="color: #81A1C1;">Kleisli</span>(<span style="color: #81A1C1;">_</span>.getObject(sourceBucketName, fileName))
  result <span style="color: #81A1C1;">=</span> pureBusinessProcess(content)
  <span style="color: #81A1C1;">_</span> <span style="color: #81A1C1;">&lt;-</span> <span style="color: #81A1C1;">Kleisli</span>(<span style="color: #81A1C1;">_</span>.putObject(targetBucketName, fileName, result))
} <span style="color: #81A1C1;">yield</span> ()
</code></pre>

<p>
A <code>Kleisli</code> before <code>_.getObject...</code> barely sacrifice our readability but the benifit we get is that we can
swap Layer 2 with abitrary interpreter in test
</p>
<pre class="code"><code><span style="color: #81A1C1;">val</span> <span style="font-weight: bold;">res</span> <span style="color: #81A1C1;">=</span> mock[<span style="color: #81A1C1;">PutObjectResult</span>]
program.run(<span style="color: #81A1C1;">new</span> <span style="color: #81A1C1;">Interpreter</span>[<span style="color: #81A1C1;">IO</span>] {
  <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">getObject</span>(bucketName<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>, fileName<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>) <span style="color: #81A1C1;">=</span> <span style="color: #81A1C1;">IO</span>(<span style="color: #D08770;">"some content"</span>)
  <span style="color: #81A1C1;">def</span> <span style="font-weight: bold;">putObject</span>(bucketName<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>, fileName<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>, content<span style="color: #81A1C1;">:</span> <span style="color: #81A1C1;">String</span>) <span style="color: #81A1C1;">=</span> res
}).unsafeRunSync() must_== res

</code></pre>
</div>
</div>
</div>
